app/views/comments/_comment.html.erb

      <small><%= comment.user.name %> says:</small>
      <small class="pull-right" ><%= comment.created_at.strftime("%H:%M") %></small>
---
INSERT INTO "comments" ("content", "user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Hello"], ["user_id", 1], ["room_id", 1], ["created_at", "2016-02-26 16:35:14.158609"], ["updated_at", "2016-02-26 16:35:14.158609"]]