app/controllers/comments_controller.rb

	def index
		if current_user
	      	@comments = @room.comments.where.not("deleted = ? AND user_id = ?", true, current_user.id).includes(:user).order('created_at ASC')
---
SELECT "comments".* FROM "comments" WHERE "comments"."room_id" = ?  ORDER BY created_at DESC  [["room_id", 1]]

	def create
	    @comment = @room.comments.new(comment_params.merge(user_id: current_user.id))
	    unless @comment.save
---
INSERT INTO "comments" ("content", "user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Hello"], ["user_id", 1], ["room_id", 1], ["created_at", "2016-02-26 16:35:14.158609"], ["updated_at", "2016-02-26 16:35:14.158609"]]

	def find_room
		@room = Room.find(params[:room_id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", 1]]