app/controllers/rooms_controller.rb

  def index
  	@room = Room.new
  	@rooms = Room.all
---
SELECT "rooms".* FROM "rooms"

  	def find_room
  		@room = Room.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", 1]]